src/cf/InformationRegisters/НастройкиПечатныхФормПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПечатныхФормПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолноеИмяФормы</Name>
					<Comment>Например, "Обработка.ЗаполнениеКонтрагентов"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>430</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиПечатныхФормПоУмолчанию/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Установить переданные настройки пользователя.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  ПолноеИмяФормы - Строка - полное имя формы объекта метаданных
//  ИмяПечатнойФормы  - Строка - имя печатной формы, вызываемой по умолчанию
//  СписокПечатныхФорм  - Строка - содержит список значений печатных форм
//   в требуемом порядке и с отметкой видимости
//
Процедура ЗаписатьНастройкиПользователя(Пользователь, ПолноеИмяФормы, ИмяПечатнойФормы, СписокПечатныхФорм) Экспорт
	
	Попытка
		
		НаборЗаписей = СоздатьНаборЗаписей();
		СокращенноеИмяФормы = ПечатьДокументовУНФ.СократитьПолноеИмяФормы(ПолноеИмяФормы); 
		НаборЗаписей.Отбор.Пользователь.Использование = Истина;
		НаборЗаписей.Отбор.Пользователь.Значение = Пользователь;
		НаборЗаписей.Отбор.ПолноеИмяФормы.Использование = Истина;
		НаборЗаписей.Отбор.ПолноеИмяФормы.Значение = СокращенноеИмяФормы;

		Запись = НаборЗаписей.Добавить();

		Запись.Пользователь = Пользователь;
		Запись.ПолноеИмяФормы = СокращенноеИмяФормы;
		Запись.ИмяПечатнойФормы = ИмяПечатнойФормы;
		Запись.Хранилище = Новый ХранилищеЗначения(СписокПечатныхФорм);
		
		НаборЗаписей.Записать();
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Печатные формы по умолчанию.Запись настроек пользователя.'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
		
	КонецПопытки;

КонецПроцедуры

// Получить сохраненные настройки пользователя.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  ПолноеИмяФормы - Строка - полное имя формы объекта метаданных
// 
// Возвращаемое значение:
// 	Строка - имя печатной формы, вызываемой по умолчанию
//
Функция НастройкиПользователя(Пользователь, ПолноеИмяФормы) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПечатныхФормПоУмолчанию.ИмяПечатнойФормы КАК ИмяПечатнойФормы,
	|	НастройкиПечатныхФормПоУмолчанию.Хранилище
	|ИЗ
	|	РегистрСведений.НастройкиПечатныхФормПоУмолчанию КАК НастройкиПечатныхФормПоУмолчанию
	|ГДЕ
	|	НастройкиПечатныхФормПоУмолчанию.Пользователь = &Пользователь
	|	И НастройкиПечатныхФормПоУмолчанию.ПолноеИмяФормы = &СокращенноеИмяФормы";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("СокращенноеИмяФормы", ПечатьДокументовУНФ.СократитьПолноеИмяФормы(ПолноеИмяФормы));
	РезультатЗапроса = Запрос.Выполнить();  

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	СтруктураНастроек = Новый Структура("ПечатнаяФормаПоУмолчанию, ПечатныеФормы", Выборка.ИмяПечатнойФормы, Выборка.Хранилище.Получить());
	Возврат СтруктураНастроек;

КонецФункции

// Удалить настройки пользователя для указанного имени формы.
// 
// Параметры:
//  Пользователь - СправочникСсылка.Пользователи - Пользователь
//  ПолноеИмяФормы - Строка - полное имя формы объекта метаданных
//
Процедура УдалитьНастройкиПользователя(Пользователь, ПолноеИмяФормы) Экспорт
	
	Попытка
		
		НаборЗаписей = СоздатьНаборЗаписей();

		НаборЗаписей.Отбор.Пользователь.Использование = Истина;
		НаборЗаписей.Отбор.Пользователь.Значение = Пользователь;
		НаборЗаписей.Отбор.ПолноеИмяФормы.Использование = Истина;
		НаборЗаписей.Отбор.ПолноеИмяФормы.Значение = ПечатьДокументовУНФ.СократитьПолноеИмяФормы(ПолноеИмяФормы);
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
	Исключение
		
		ТекстОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(НСтр("ru='Печатные формы по умолчанию.Удаление настроек пользователя.'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ТекстОшибки);
		
	КонецПопытки;

КонецПроцедуры

#КонецОбласти


#КонецЕсли
